//=====================================
//
//テンプレートヘッダ[template.h]
//Author:GP11A341 21 立花雄太
//
//=====================================
#ifndef _INSTANCING_H_
#define _INSTANCING_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/
	
/**************************************
プロトタイプ宣言
***************************************/
void InitInstancing(int num);
void UninitInstancing(void);
void UpdateInstancing(void);
void DrawInstancing(void);

#endif